{
  "apigateway:request/accessloggingdestination": {
    "key": "apigateway:Request/AccessLoggingDestination",
    "description": "Filters access by access log destination. Available during the CreateStage and UpdateStage operations",
    "type": "String"
  },
  "apigateway:request/accessloggingformat": {
    "key": "apigateway:Request/AccessLoggingFormat",
    "description": "Filters access by access log format. Available during the CreateStage and UpdateStage operations",
    "type": "String"
  },
  "apigateway:request/apikeyrequired": {
    "key": "apigateway:Request/ApiKeyRequired",
    "description": "Filters access by whether an API key is required or not. Available during the CreateMethod and PutMethod operations. Also available as a collection during import and reimport",
    "type": "ArrayOfBool"
  },
  "apigateway:request/apiname": {
    "key": "apigateway:Request/ApiName",
    "description": "Filters access by API name. Available during the CreateRestApi and UpdateRestApi operations",
    "type": "String"
  },
  "apigateway:request/authorizertype": {
    "key": "apigateway:Request/AuthorizerType",
    "description": "Filters access by type of authorizer in the request, for example TOKEN, REQUEST, JWT. Available during CreateAuthorizer and UpdateAuthorizer. Also available during import and reimport as an ArrayOfString",
    "type": "ArrayOfString"
  },
  "apigateway:request/authorizeruri": {
    "key": "apigateway:Request/AuthorizerUri",
    "description": "Filters access by URI of a Lambda authorizer function. Available during CreateAuthorizer and UpdateAuthorizer. Also available during import and reimport as an ArrayOfString",
    "type": "ArrayOfString"
  },
  "apigateway:request/disableexecuteapiendpoint": {
    "key": "apigateway:Request/DisableExecuteApiEndpoint",
    "description": "Filters access by status of the default execute-api endpoint. Available during the CreateRestApi and DeleteRestApi operations",
    "type": "Bool"
  },
  "apigateway:request/endpointtype": {
    "key": "apigateway:Request/EndpointType",
    "description": "Filters access by endpoint type. Available during the CreateDomainName, UpdateDomainName, CreateRestApi, and UpdateRestApi operations",
    "type": "ArrayOfString"
  },
  "apigateway:request/mtlstruststoreuri": {
    "key": "apigateway:Request/MtlsTrustStoreUri",
    "description": "Filters access by URI of the truststore used for mutual TLS authentication. Available during the CreateDomainName and UpdateDomainName operations",
    "type": "String"
  },
  "apigateway:request/mtlstruststoreversion": {
    "key": "apigateway:Request/MtlsTrustStoreVersion",
    "description": "Filters access by version of the truststore used for mutual TLS authentication. Available during the CreateDomainName and UpdateDomainName operations",
    "type": "String"
  },
  "apigateway:request/routeauthorizationtype": {
    "key": "apigateway:Request/RouteAuthorizationType",
    "description": "Filters access by authorization type, for example NONE, AWS_IAM, CUSTOM, JWT, COGNITO_USER_POOLS. Available during the CreateMethod and PutMethod operations Also available as a collection during import",
    "type": "ArrayOfString"
  },
  "apigateway:request/securitypolicy": {
    "key": "apigateway:Request/SecurityPolicy",
    "description": "Filters access by TLS version. Available during the CreateDomain and UpdateDomain operations",
    "type": "ArrayOfString"
  },
  "apigateway:request/stagename": {
    "key": "apigateway:Request/StageName",
    "description": "Filters access by stage name of the deployment that you attempt to create. Available during the CreateDeployment operation",
    "type": "String"
  },
  "apigateway:resource/accessloggingdestination": {
    "key": "apigateway:Resource/AccessLoggingDestination",
    "description": "Filters access by access log destination of the current Stage resource. Available during the UpdateStage and DeleteStage operations",
    "type": "String"
  },
  "apigateway:resource/accessloggingformat": {
    "key": "apigateway:Resource/AccessLoggingFormat",
    "description": "Filters access by access log format of the current Stage resource. Available during the UpdateStage and DeleteStage operations",
    "type": "String"
  },
  "apigateway:resource/apikeyrequired": {
    "key": "apigateway:Resource/ApiKeyRequired",
    "description": "Filters access by whether an API key is required or not for the existing Method resource. Available during the PutMethod and DeleteMethod operations. Also available as a collection during reimport",
    "type": "ArrayOfBool"
  },
  "apigateway:resource/apiname": {
    "key": "apigateway:Resource/ApiName",
    "description": "Filters access by API name of the existing RestApi resource. Available during UpdateRestApi and DeleteRestApi operations",
    "type": "String"
  },
  "apigateway:resource/authorizertype": {
    "key": "apigateway:Resource/AuthorizerType",
    "description": "Filters access by the current type of authorizer, for example TOKEN, REQUEST, JWT. Available during UpdateAuthorizer and DeleteAuthorizer operations. Also available during reimport as an ArrayOfString",
    "type": "ArrayOfString"
  },
  "apigateway:resource/authorizeruri": {
    "key": "apigateway:Resource/AuthorizerUri",
    "description": "Filters access by URI of a Lambda authorizer function. Available during UpdateAuthorizer and DeleteAuthorizer operations. Also available during reimport as an ArrayOfString",
    "type": "ArrayOfString"
  },
  "apigateway:resource/disableexecuteapiendpoint": {
    "key": "apigateway:Resource/DisableExecuteApiEndpoint",
    "description": "Filters access by status of the default execute-api endpoint of the current RestApi resource. Available during UpdateRestApi and DeleteRestApi operations",
    "type": "Bool"
  },
  "apigateway:resource/endpointtype": {
    "key": "apigateway:Resource/EndpointType",
    "description": "Filters access by endpoint type. Available during the UpdateDomainName, DeleteDomainName, UpdateRestApi, and DeleteRestApi operations",
    "type": "ArrayOfString"
  },
  "apigateway:resource/mtlstruststoreuri": {
    "key": "apigateway:Resource/MtlsTrustStoreUri",
    "description": "Filters access by URI of the truststore used for mutual TLS authentication. Available during UpdateDomainName and DeleteDomainName operations",
    "type": "String"
  },
  "apigateway:resource/mtlstruststoreversion": {
    "key": "apigateway:Resource/MtlsTrustStoreVersion",
    "description": "Filters access by version of the truststore used for mutual TLS authentication. Available during UpdateDomainName and DeleteDomainName operations",
    "type": "String"
  },
  "apigateway:resource/routeauthorizationtype": {
    "key": "apigateway:Resource/RouteAuthorizationType",
    "description": "Filters access by authorization type of the existing Method resource, for example NONE, AWS_IAM, CUSTOM, JWT, COGNITO_USER_POOLS. Available during the PutMethod and DeleteMethod operations. Also available as a collection during reimport",
    "type": "ArrayOfString"
  },
  "apigateway:resource/securitypolicy": {
    "key": "apigateway:Resource/SecurityPolicy",
    "description": "Filters access by TLS version. Available during UpdateDomain and DeleteDomain operations",
    "type": "ArrayOfString"
  },
  "aws:requesttag/${tagkey}": {
    "key": "aws:RequestTag/${TagKey}",
    "description": "Filters access by the tag key-value pairs in the request",
    "type": "String"
  },
  "aws:resourcetag/${tagkey}": {
    "key": "aws:ResourceTag/${TagKey}",
    "description": "Filters access by the tags attached to the resource",
    "type": "String"
  },
  "aws:tagkeys": {
    "key": "aws:TagKeys",
    "description": "Filters access by the tag keys in the request",
    "type": "ArrayOfString"
  }
}